<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Global Language Lines
    |--------------------------------------------------------------------------
    */
    'header' => [
        'menu' => [
            'about' => 'О нас',
            'login' => 'Войти',
            'logout' => 'Выйти',
            'register' => 'Регистрация',
            'my_books' => 'Мои книги',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Pages Language Lines
    |--------------------------------------------------------------------------
    */
    'home' => [
        'title' => 'библиотека колледжа',
        'description' => 'Наша электронная библиотека предоставляет доступ к разнообразным учебным материалам, научным публикациям и литературе, которые помогут вам в обучении и исследовательской деятельности.',
    ],

    'register' => [
        'title' => 'Регистрация',
        'teacher' => 'Преподаватель',
        'student' => 'Студент',
        'btn' => 'Зарегистрироваться',
        'info' => [
            'title' => 'Уже есть аккаунт ?',
            'description' => 'Если у тебя есть аккаунт, скорее заходи и продолжай изучать интересующие темы!',
            'btn' => 'Войти',
        ],
    ],

    'login' => [
        'title' => 'Вход',
        'remember_me' => 'Запомнить меня',
        'btn' => 'ВОЙТИ',
        'info' => [
            'title' => 'Еще нет аккаунта?',
            'description' => 'Не теряй время, регистрируйся у нас и получай знания на любую тему!',
            'btn' => 'Зарегистрироваться',
        ],
    ],


     /*
    |--------------------------------------------------------------------------
    | Messages Language Lines
    |--------------------------------------------------------------------------
    */
    'catalog' => 'Каталог',
    'read' => 'Читать',
    'category' => 'Категория',
    'categories' => 'Категории',
    'favorites' => 'Избранное',
    'add_books' => 'Книги, добавленные вами',
    'load_book' => 'Загрузить книгу',
    'professions' => 'Специальности',
    'back' => 'Назад',
    'next' => 'Врепед',
    'empty' => 'Ничего не найдено',

    /*
    |--------------------------------------------------------------------------
    | Fields Language Lines
    |--------------------------------------------------------------------------
    */
    'fields' => [
        'name' => [
            'label' => 'Имя Фамилия',
            'placeholder' => 'Иван Иванов',
        ],
        'email' => [
            'label' => 'Почта',
        ],
        'password' => [
            'label' => 'Пароль',
        ],
    ],
];
