<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Global Language Lines
    |--------------------------------------------------------------------------
    */
    'header' => [
        'menu' => [
            'about' => 'Біз туралы',
            'login' => 'Кіру',
            'logout' => 'Шығу',
            'register' => 'Тіркелу',
            'my_books' => 'Менің кітаптарым',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Pages Language Lines
    |--------------------------------------------------------------------------
    */
    'home' => [
        'title' => 'колледж кітапханасы',
        'description' => 'Біздің электронды кітапхана әртүрлі оқу материалдарына, ғылыми жарияланымдарға және әдебиетке қол жеткізуге мүмкіндік береді, бұл сіздің оқу және зерттеу қызметіңізге көмектеседі.',
    ],

    'register' => [
        'title' => 'Тіркелу',
        'teacher' => 'Оқытушы',
        'student' => 'Студент',
        'btn' => 'Тіркелу',
        'info' => [
            'title' => 'Аккаунтыңыз бар ма?',
            'description' => 'Егер сізде аккаунт бар болса, жылдам кіріп, қызықты тақырыптарды зерттеуді жалғастырыңыз!',
            'btn' => 'Кіру',
        ],
    ],

    'login' => [
        'title' => 'Кіру',
        'remember_me' => 'Мені есте сақтау',
        'btn' => 'КІРУ',
        'info' => [
            'title' => 'Әлі аккаунтыңыз жоқ па?',
            'description' => 'Уақыт жоғалтпаңыз, бізге тіркеліңіз және кез келген тақырып бойынша білім алыңыз!',
            'btn' => 'Тіркелу',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Messages Language Lines
    |--------------------------------------------------------------------------
    */
    'catalog' => 'Каталог',
    'read' => 'Оқу',
    'category' => 'Санат',
    'categories' => 'Санаттар',
    'favorites' => 'Таңдаулылар',
    'add_books' => 'Сіз қосқан кітаптар',

    /*
    |--------------------------------------------------------------------------
    | Fields Language Lines
    |--------------------------------------------------------------------------
    */
    'fields' => [
        'name' => [
            'label' => 'Аты-жөні',
            'placeholder' => 'Иван Иванов',
        ],
        'email' => [
            'label' => 'Электрондық пошта',
        ],
        'password' => [
            'label' => 'Құпия сөз',
        ],
    ],
];
